In [14]:
import mysql.connector
import pandas as pd

In [15]:
mydb = mysql.connector.connect(host="localhost",user="root",password="root",database = "imdb")

In [16]:
mycursor = mydb.cursor()

In [17]:
type(mycursor)

mysql.connector.cursor_cext.CMySQLCursor

In [18]:
mycursor.execute('select * from actors')
data = mycursor.fetchall()

In [19]:
len(data)

817718

In [20]:
for i in data[0:10]:
    print(i[0],i[1])

2 Michael
3 Eloy
4 Dieguito
5 Antonio
6 José
7 Félix
8 Marcial
9 José
10 Francisco
11 Víctor

In [23]:
df = pd.DataFrame(data,columns=['Id','First Name','Last Name','Gender'])

In [24]:
df

            Id     First Name           Last Name Gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
817713  845461         Herdís      Þorvaldsdóttir      F
817714  845462  Katla Margrét      Þorvaldsdóttir      F
817715  845463     Lilja Nótt      Þórarinsdóttir      F
817716  845464     Hólmfríður      Þórhallsdóttir      F
817717  845465       Theódóra        Þórðardóttir      F

[817718 rows x 4 columns]